microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_osc.h
/*LICENSE ********************************************************************
 * Microchip Technology Inc. and its subsidiaries.  You may use this software 
 * and any derivatives exclusively with Microchip products. 
 * 
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS".  NO WARRANTIES, WHETHER 
 * EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED 
 * WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A 
 * PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION 
 * WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION. 
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
 * INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
 * WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS 
 * BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE 
 * FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS 
 * IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF 
 * ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE 
 * TERMS. 
 * ***************************************************************************/
/*!p33SMPS_oscillator.h
 * ***************************************************************************
 *
 * File:    p33c_osc.h
 * Author:  M91406
 * Created: October 27, 2017, 11:24 AM
 * 
 * History:
 * 10/27/17 initial release
 * 07/07/18 separation of FJ, EP and CH/CK device families
 * 
 * Know limitations in this release:
 * 
 * - REFCLK is not supported
 * ***************************************************************************/

#ifndef MCAL_P33SMPS_OSCILLATOR_H
#define MCAL_P33SMPS_OSCILLATOR_H

#include <xc.h> // include processor files - each processor file is guarded.  
#include <stdint.h> // include standard integer types header file
#include <stdbool.h> // include standard boolean types header file

#include "p33smps_devices.h" // DEVICES header to derive device-dependent properties

/*!System Frequencies
 * ************************************************************************************************
 * Summary:
 * Set of defines, data types and data structures for system frequency adaption
 *
 * Description:
 * This library offers default preset for CPU frequencies to simplify the oscillator 
 * configuration for standard applications using the internal Fast RC oscillator (FRC).
 * These parameters are supposed to be used with the function call init_FRCCLK_Defaults().
 * To change the CPU frequency at any point during runtime, clock switching must be enabled
 * by setting the configuration bit FCKSM:
 * 
 *      #pragma config FCKSM = CSECMD (Clock Switching Enabled/Clock Monitor Disabled) 
 *   or                        CSECME (Clock Switching Enabled/Clock Monitor Enabled)
 * 
 * Example:
 * The following code line configures the internal FRC oscillator for 80 MIPS operation:
 * 
 *      init_FRCCLK_Defaults(CPU_SPEED_80_MIPS);    // Configuring FRC for 80 MIPS operation
 * 
 * ***********************************************************************************************/

typedef enum 
{
    CPU_SPEED_20_MIPS = 20, // CPU Speed setting for 20 MIPS operation
    CPU_SPEED_30_MIPS = 30, // CPU Speed setting for 30 MIPS operation
    CPU_SPEED_40_MIPS = 40, // CPU Speed setting for 40 MIPS operation
    CPU_SPEED_50_MIPS = 50, // CPU Speed setting for 50 MIPS operation
    CPU_SPEED_60_MIPS = 60, // CPU Speed setting for 60 MIPS operation
    CPU_SPEED_70_MIPS = 70, // CPU Speed setting for 70 MIPS operation
    CPU_SPEED_80_MIPS = 80, // CPU Speed setting for 80 MIPS operation
    CPU_SPEED_90_MIPS = 90, // CPU Speed setting for 90 MIPS operation
    CPU_SPEED_100_MIPS = 100 // CPU Speed setting for 100 MIPS operation
} CPU_SPEED_DEFAULTS_e;  // Default CPU speed settings 


typedef enum 
{
    AFPLLO_100_MHZ  = 100, // Auxiliary PLL output frequency of 500 MHz
    AFPLLO_200_MHZ  = 200, // Auxiliary PLL output frequency of 500 MHz
    AFPLLO_300_MHZ  = 300, // Auxiliary PLL output frequency of 500 MHz
    AFPLLO_400_MHZ  = 400, // Auxiliary PLL output frequency of 500 MHz
    AFPLLO_500_MHZ  = 500, // Auxiliary PLL output frequency of 500 MHz (Default for high resolution PWM)
    AFPLLO_600_MHZ  = 600, // Auxiliary PLL output frequency of 600 MHz
    AFPLLO_700_MHZ  = 700, // Auxiliary PLL output frequency of 700 MHz
    AFPLLO_800_MHZ  = 800  // Auxiliary PLL output frequency of 800 MHz
} AUX_PLL_DEFAULTS_e;  // Default Auxiliary PLL output frequency settings 


/*!System OSCILLATOR_SYSTEM_FREQUENCIES_t
 * ************************************************************************************************
 * Summary:
 * Global data structure holding system frequencies of different clock domains
 *
 * Description:
 * The data structure "system_frequencies" of type OSCILLATOR_SYSTEM_FREQUENCIES_t is used
 * to broadcast most recent system frequencies of multiple clock domains. Contents of this data 
 * structure are NOT updated automatically. 
 * 
 * The function osc_get_frequencies() must be called from user code to update/refresh the 
 * contents of this data structure every time a oscillator configuration has been changed.
 *
 * Example:
 * The following code lines initialize the internal FRC oscillator for 100 MIPS operation and
 * the auxiliary PLL for 500 MHz to support 250ps resolution of the PWM module. After both 
 * configurations have been set, the function 'osc_get_frequencies()' is used to update the 
 * most recent frequencies of multiple clock domains.
 * 
 *      init_FRCCLK_Defaults(CPU_SPEED_100_MIPS);   // Initialize FRC for 100 MIPS operation
 *      init_AUXCLK_500MHz();                       // Initialize AuxPLL for 500 MHz clock output
 *      osc_get_frequencies(0);                     // Update system frequencies data structure
 * 
 * Please note: 
 * When an external oscillator is used, the function osc_get_frequencies() must be called 
 * to set the external frequency value in [Hz] and update all related frequencies accordingly.
 * If only the internal FRC oscillator is used, this parameter should be set = 0.
 * ***********************************************************************************************/

