microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_osc.h
typedef struct {
    volatile uint32_t frc;      // Internal fast RC oscillator frequency incl. tuning
    volatile uint32_t fpri;     // External primary oscillator frequency 
    volatile uint32_t fclk;     // Clock frequency (external or internal oscillator frequency)
    volatile uint32_t fosc;     // Oscillator frequency
    volatile uint32_t fcy;      // CPU click frequency (instruction frequency = MIPS incl. DOZE divider)
    volatile uint32_t fp;       // Peripheral bus clock frequency
    volatile uint32_t fpllo;    // PLL output frequency
    volatile uint32_t fvco;     // PLL VCO frequency output incl. divider
    volatile float tp;          // Peripheral clock period 
    volatile float tcy;         // CPU clock period 
    volatile uint32_t afpllo;   // APLL output frequency
    volatile uint32_t afvco;    // APLL VCO frequency output incl. divider
}OSCILLATOR_SYSTEM_FREQUENCIES_t;


/* FRC oscillator settings and tuning */
#if defined (__P33SMPS_CH__) 

    #define FRCTUN_MIN              -32     // minimum tuning value
    #define FRCTUN_MAX              31      // maximum tuning value
    #define OSC_FRC_FREQ            8000000     // Frequency of the internal oscillator in [Hz]
    #define OSC_FRC_TUN             0           // <OSCTUN> FRC Oscillator Tuning Rregister default value
    #define OSC_TUN_STEP_PERCENTAGE 0.00047     // Oscillator frequency step size of <OSCTUN>

#elif defined (__P33SMPS_CK__) 

    #define FRCTUN_MIN              -32     // minimum tuning value
    #define FRCTUN_MAX              31      // maximum tuning value
    #define OSC_FRC_FREQ            8000000     // Frequency of the internal oscillator in [Hz]
    #define OSC_FRC_TUN             0           // <OSCTUN> FRC Oscillator Tuning Rregister value
    #define OSC_TUN_STEP_PERCENTAGE 0.00047     // Oscillator frequency step size of <OSCTUN>

#else
    #pragma message "error: === selected device family not supported by oscillator mcal driver library ==="
#endif

#define OSC_TUN_STEP_FREQUENCY  (volatile int32_t)(OSC_FRC_FREQ * OSC_TUN_STEP_PERCENTAGE)

/* ***************************************************************************************
 *	BASIC DEFINES
 * **************************************************************************************/

/* ===========================================================================
 * OSCCON: OSCILLATOR CONTROL REGISTER
 * ===========================================================================*/

#define REG_OSCCON_VALID_DATA_WRITE_MASK    0x0789
#define REG_OSCCON_VALID_DATA_READ_MASK     0x77A9

#define REG_OSCCON_OSWEN_REQUEST_SWITCH  0b0000000000001000
#define REG_OSCCON_OSWEN_SWITCH_COMPLETE 0b0000000000000000

typedef enum {
    OSCCON_OSWEN_REQUEST_SWITCH = 0b1, // Requests oscillator switch to the selection specified by the NOSC<2:0> bits
    OSCCON_OSWEN_SWITCH_COMPLETE = 0b0 // Oscillator switch is complete
} OSCCON_OSWEN_e; // Oscillator Switch Enable bit

#define REG_OSCCON_CF_CLKSTAT_FAIL 0b0000000000001000
#define REG_OSCCON_CF_CLKSTAT_OK   0b0000000000000000

typedef enum {
    OSCCON_CF_CLKSTAT_FAIL = 0b1, // FSCM has detected a clock failure
    OSCCON_CF_CLKSTAT_OK = 0b0 // FSCM has not detected a clock failure
} OSCCON_CF_e; // Clock Fail Detect bit

#define REG_OSCCON_LOCK_PLL_LOCKED   0b0000000000100000
#define REG_OSCCON_LOCK_PLL_UNLOCKED 0b0000000000000000

typedef enum {
    OSCCON_LOCK_PLL_LOCKED = 0b1, // Indicates that PLL is in lock or PLL start-up timer is satisfied
    OSCCON_LOCK_PLL_UNLOCKED = 0b0 // Indicates that PLL is out of lock, start-up timer is in progress or PLL is disabled
} OSCCON_LOCK_e; // PLL Lock Status bit (read-only)

#define REG_OSCCON_CLKLOCK_LOCKED   0b0000000010000000
#define REG_OSCCON_CLKLOCK_UNLOCKED 0b0000000000000000

typedef enum {
    OSCCON_CLKLOCK_LOCKED = 0b1, // If (FCKSM0 = 1), then clock and PLL configurations are locked; if (FCKSM0 = 0), then clock and PLL configurations may be modified
    OSCCON_CLKLOCK_UNLOCKED = 0b0 // Clock and PLL selections are not locked, configurations may be modified
} OSCCON_CLKLOCK_e; // Clock Lock Enable bit

#define REG_OSCCON_NOSC_FRCDIVN 0b0000011100000000
#define REG_OSCCON_NOSC_BFRC    0b0000011000000000
#define REG_OSCCON_NOSC_LPRC    0b0000010100000000
#define REG_OSCCON_NOSC_PRIPLL  0b0000001100000000
#define REG_OSCCON_NOSC_PRI     0b0000001000000000
#define REG_OSCCON_NOSC_FRCPLL  0b0000000100000000
#define REG_OSCCON_NOSC_FRC     0b0000000000000000

#define REG_OSCCON_COSC_FRCDIVN 0b0111000000000000
#define REG_OSCCON_COSC_BFRC    0b0110000000000000
#define REG_OSCCON_COSC_LPRC    0b0101000000000000
#define REG_OSCCON_COSC_PRIPLL  0b0011000000000000
#define REG_OSCCON_COSC_PRI     0b0010000000000000
#define REG_OSCCON_COSC_FRCPLL  0b0001000000000000
#define REG_OSCCON_COSC_FRC     0b0000000000000000


typedef enum {
    OSCCON_xOSC_FRC = 0b000, // Fast RC Oscillator, no PLL 
    OSCCON_xOSC_FRCPLL = 0b001, // Fast RC Oscillator with PLL
    OSCCON_xOSC_PRI = 0b010, // Primary Oscillator (EC, XT, HS), no PLL
    OSCCON_xOSC_PRIPLL = 0b011, // Primary Oscillator (EC, XT, HS) with PLL
    OSCCON_xOSC_LPRC = 0b101, // Low Power Oscillator for Idle/Sleep Mode
    OSCCON_xOSC_BFRC = 0b110, // Backup Fast RC Oscillator
    OSCCON_xOSC_FRCDIVN = 0b111 // Fast RC Oscillator with variable Divider
} OSCCON_xOSC_TYPE_e ;// Oscillator Type Selection bits

typedef struct {
    volatile OSCCON_OSWEN_e OSWEN : 1; // Oscillator Switch Enable bit
    volatile unsigned : 2; // reserved
    volatile OSCCON_CF_e CF : 1; // Clock Fail Detect bit
    volatile unsigned : 1; // reserved
    volatile OSCCON_LOCK_e LOCK : 1; // PLL Lock Status bit (read only)
    volatile unsigned : 1; // reserved
    volatile OSCCON_CLKLOCK_e CLKLOCK : 1; // Clock Lock Enable bit
    volatile OSCCON_xOSC_TYPE_e NOSC : 3; // New Oscillator Selection bits
    volatile unsigned : 1; // reserved
    volatile OSCCON_xOSC_TYPE_e COSC : 3; // Current Oscillator Selection bits (read only)

