microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_osc.h
typedef struct {
    volatile APLLFBD_APLLFBDIV_e APLLFBDIV : 8; // APLL Feedback Divider bits (also denoted as ?M?, PLL multiplier)
    volatile unsigned : 8; // reserved
} APLLFBD_t; // APLL Feedback Divider bits

typedef union {
    volatile uint16_t value;
    volatile APLLFBD_t APLLFBD; // APLL Feedback Divider bits
} REGBLK_APLLFBD_CONFIG_t;

#else
    #pragma message "error: === selected device family is not supported by oscillator mcal library ==="
#endif

/* ===========================================================================
 * APLLDIV1: APLL OUTPUT DIVIDER REGISTER
 * ===========================================================================*/

#if defined (__P33SMPS_CH__) ||  defined (__P33SMPS_CK__)

#define REG_APLLDIV_VALID_DATA_WRITE_MASK    0x0377
#define REG_APLLDIV_VALID_DATA_READ_MASK     0x0377

#define REG_APLLDIV_POST1DIV_N2_MASK         0b0000000001110000
#define REG_APLLDIV_POST1DIV_N2(x)     ((x << 4) & REG_APLLDIV_POST1DIV_N2_MASK)

#define REG_APLLDIV_POST2DIV_N3_MASK         0b0000000000000111
#define REG_APLLDIV_POST2DIV_N3(x)     (x & REG_APLLDIV_POST1DIV_N3_MASK)

typedef enum {
    APLLDIV_POST2DIV_N2N3_1 = 0b001, // PLL Output Divider Ratio bits 1:1
    APLLDIV_POST2DIV_N2N3_2 = 0b010, // PLL Output Divider Ratio bits 1:2
    APLLDIV_POST2DIV_N2N3_3 = 0b011, // PLL Output Divider Ratio bits 1:3
    APLLDIV_POST2DIV_N2N3_4 = 0b100, // PLL Output Divider Ratio bits 1:4
    APLLDIV_POST2DIV_N2N3_5 = 0b101, // PLL Output Divider Ratio bits 1:5
    APLLDIV_POST2DIV_N2N3_6 = 0b110, // PLL Output Divider Ratio bits 1:6
    APLLDIV_POST2DIV_N2N3_7 = 0b111 // PLL Output Divider Ratio bits 1:7
} APLLDIV_POSTxDIV_e; // PLL Output Divider Ratio bits (also denoted as ?N2? and ?N3?, PLL divider)

#define REG_APLLDIV_AVCODIV_FVCO_DIV_BY_1	0b0000001100000000
#define REG_APLLDIV_AVCODIV_FVCO_DIV_BY_2	0b0000001000000000
#define REG_APLLDIV_AVCODIV_FVCO_DIV_BY_3	0b0000000100000000
#define REG_APLLDIV_AVCODIV_FVCO_DIV_BY_4	0b0000000000000000

typedef enum {
    APLLDIV_AVCODIV_FVCO_DIV_BY_1 = 0b11, // APLL AVCO Output Divider 1:1
    APLLDIV_AVCODIV_FVCO_DIV_BY_2 = 0b10, // APLL AVCO Output Divider 1:2
    APLLDIV_AVCODIV_FVCO_DIV_BY_3 = 0b01, // APLL AVCO Output Divider 1:3
    APLLDIV_AVCODIV_FVCO_DIV_BY_4 = 0b00 // APLL AVCO Output Divider 1:4
} APLLDIV_AVCODIV_e; // APLL AVCO Output Divider Select bits

typedef struct {
    volatile APLLDIV_POSTxDIV_e APOST2DIV : 3;
    volatile unsigned : 1;
    volatile APLLDIV_POSTxDIV_e APOST1DIV : 3;
    volatile unsigned : 1;
    volatile APLLDIV_AVCODIV_e AVCODIV : 2;
    volatile unsigned : 6;
} __attribute__((packed)) APLLDIV_t;

typedef union {
    volatile uint16_t value;
    volatile APLLDIV_t APLLDIV; // APLL Output Divider Select bits
} REGBLK_APLLDIV_CONFIG_t;

#else
    #pragma message "error: === selected device family is not supported by oscillator mcal library ==="
#endif

/* ===========================================================================
 * OSCILLATOR CONFIGURATION OBJECT 
 * ===========================================================================*/

#if defined (__P33SMPS_CH__) ||  defined (__P33SMPS_CK__)

typedef struct P33C_OSC_CONFIG_s {
    volatile OSCCON_xOSC_TYPE_e osc_type;
    volatile CLKDIV_FRCDIVN_e frc_div;
    volatile OSCTUN_TUN_e frc_tune;
    volatile CLKDIV_PLLPRE_e N1;
    volatile PLLFBD_PLLFBDIV_e M;
    volatile PLLDIV_POSTxDIV_e N2;
    volatile PLLDIV_POSTxDIV_e N3;
    volatile PLLDIV_VCODIV_e VCODIV;
} OSC_CONFIG_t;

typedef struct {
    volatile ACLKCON_APLLPRE_e N1;
    volatile APLLFBD_APLLFBDIV_e M;
    volatile APLLDIV_POSTxDIV_e N2;
    volatile APLLDIV_POSTxDIV_e N3;
    volatile APLLDIV_AVCODIV_e AVCODIV;
    volatile ACLKCON_FRCSEL_e FRCSEL : 1;
    volatile ACLKCON_APLLCK_e APLLCK : 1;
    volatile ACLKCON_APLLEN_e APLLEN : 1;
} AUXOSC_CONFIG_t;

#else
    #pragma message "error: === selected device family is not supported by oscillator mcal library ==="
#endif


/* ***************************************************************************************
 *	ERROR CODES
 * **************************************************************************************/

typedef enum {
    OSCERR_FAILURE = 0x0000, // Global Clock Error
    OSCERR_SUCCESS = 0x0001, // Clock initialization was successfully performed
    OSCERR_CSF = 0x0002, // Clock switch-over failed
    OSCERR_RST = 0x0004, // Clock switch-over failed
    OSCERR_CSD = 0x0008, // Clock switching is disabled but desired clock differs from current clock
    OSCERR_PLL_LCK = 0x0010, // Primary PLL does not lock in
    OSCERR_APLL_LCK = 0x0020, // Auxiliary PLL does not lock in
} OSC_CFG_ERR_RESULT_t;


/* ***************************************************************************************
 *	Prototypes
 * **************************************************************************************/

extern volatile uint16_t p33c_Osc_Initialize(volatile OSC_CONFIG_t osc_config);
extern volatile uint16_t p33c_OscFrc_Initialize(volatile CLKDIV_FRCDIVN_e frc_div, volatile OSCTUN_TUN_e frc_tun);
extern volatile uint16_t p33c_OscAuxClk_Initialize(volatile AUXOSC_CONFIG_t aux_clock_config);

extern volatile uint16_t p33c_OscFrc_DefaultInitialize(volatile CPU_SPEED_DEFAULTS_e cpu_speed);
extern volatile uint16_t p33c_OscAuxClk_DefaultInitialize(volatile AUX_PLL_DEFAULTS_e afpllo_frequency);
extern volatile uint16_t p33c_Osc_GetFrequencies(volatile uint32_t main_osc_frequency);

#endif  /* MCAL_P33SMPS_OSCILLATOR_H */
